In [400]:
# Import the Payroll data to complete the following excerceise
import os,numpy as np
import pandas as pd

In [401]:
from datetime import date
from datetime import time
from datetime import datetime

import warnings
warnings.filterwarnings("ignore")

In [402]:
os.chdir('E:\ml folder\data')

In [403]:
payroll=pd.read_csv('payroll2.csv')

In [404]:
payroll.head()

,Unnamed: 0,Employee_ID,Employee_Gender,Salary,Birth_Date,Employee_Hire_Date,Dependents,avg_sal_per_head,test
0,0,120101,M,163040,8/18/1978,7/1/2005,0,inf,inf
1,1,120102,M,108255,8/11/1971,6/1/1991,2,54128.0,54128.0
2,2,120103,M,87975,1/22/1951,1/1/1976,1,87975.0,87975.0
3,3,120104,F,46230,5/11/1956,1/1/1983,1,46230.0,46230.0
4,4,120105,F,27110,12/21/1976,5/1/2001,0,inf,inf

In [405]:
#Q1 import nortel dataset create m1,m2,m3 upto m12  monthly datasets based on Reg_date
nortel = pd.read_excel("nortel.xlsx")

In [406]:
nortel.head()

,Unnamed: 0,Acc_no,REG_No,Reg_date,Comp_date,Month_year,RP,RS,Unit,IR,...,t_respond,Understand,t_resolve,s_equipment,s_Del,speak,adv_status,overallper_sat,t_respond_sat,understand_sat
0,0,CST-H514-H3H,NaN,2004-05-14,2005-05-25,2005-05,4 - L,4-C_problem,GPK,Solved,...,60,60,60,NaN,NaN,60.0,60.0,NaN,NaN,NaN
1,1,CST-H7H6-HH28,CZK3B39B,2004-06-07,2005-08-06,2005-06,3 - M,3-Minor,GPK,Solved,...,90,90,90,NaN,80.0,90.0,90.0,1.0,1.0,1.0
2,2,CST-H9H1-HH86,NaN,2004-01-09,2005-03-05,2005-05,3 - M,4-C_problem,RPLCDS,Solved,...,100,100,50,NaN,NaN,90.0,100.0,0.0,1.0,1.0
3,3,CST-1H29-H233,NaN,2004-10-29,2005-05-27,2005-05,2 - H,2-Major,RPLCDS,Solved,...,90,90,80,NaN,NaN,80.0,80.0,NaN,1.0,1.0
4,4,CST-11H2-H312,CZK26998,2004-02-11,2005-09-05,2005-05,3 - M,3-Minor,GPK,Solved,...,80,80,10,NaN,100.0,90.0,90.0,0.0,1.0,1.0

In [407]:
nortel.columns

Index(['Unnamed: 0', 'Acc_no', 'REG_No', 'Reg_date', 'Comp_date', 'Month_year',
       'RP', 'RS', 'Unit', 'IR', 'Performance', 'OverallPer', 't_respond',
       'Understand', 't_resolve', 's_equipment', 's_Del', 'speak',
       'adv_status', 'overallper_sat', 't_respond_sat', 'understand_sat'],
      dtype='object')

In [423]:
nortel.drop(['s_equipment'],axis=1,inplace=True)

In [424]:
nortel.shape

(3144, 21)

In [425]:
nortel["Reg_date"]=pd.to_datetime(nortel["Reg_date"])

In [426]:
nortel_M1 = nortel[nortel.Reg_date.dt.month.isin([1])]

In [427]:
nortel_M1.shape

(213, 21)

In [428]:
M1=nortel_M1.dropna()

In [429]:
M1=nortel_M1.dropna()

In [430]:
M1.shape

(21, 21)

In [431]:
nortel_M2 = nortel[nortel.Reg_date.dt.month.isin([2])]

In [432]:
nortel_M2.shape

(143, 21)

In [433]:
M2 = nortel_M2.dropna()

In [434]:
M2.shape

(18, 21)

In [435]:
nortel_M3 = nortel[nortel.Reg_date.dt.month.isin([3])]

In [436]:
nortel_M3.shape

(141, 21)

In [437]:
M3 = nortel_M3.dropna()

In [438]:
M3.shape

(9, 21)

In [439]:
nortel_M4 = nortel[nortel.Reg_date.dt.month.isin([4])]
nortel_M4.shape

(172, 21)

In [440]:
M4 = nortel_M4.dropna()

In [441]:
M4.shape

(23, 21)

In [442]:
nortel_M5 = nortel[nortel.Reg_date.dt.month.isin([5])]
nortel_M5.shape

(229, 21)

In [443]:
M5 = nortel_M5.dropna()
M5.shape

(30, 21)

In [444]:
nortel_M6 = nortel[nortel.Reg_date.dt.month.isin([6])]
nortel_M6.shape

(276, 21)

In [445]:
M6 = nortel_M6.dropna()
M6.shape

(24, 21)

In [446]:
M6.shape

(24, 21)

In [447]:
nortel_M7 = nortel[nortel.Reg_date.dt.month.isin([7])]
nortel_M7.shape

(249, 21)

In [448]:
M7 = nortel_M7.dropna()

In [449]:
M7.shape

(33, 21)

In [450]:
nortel_M8 = nortel[nortel.Reg_date.dt.month.isin([8])]

In [451]:
nortel_M8.shape

(273, 21)

In [452]:
M8 = nortel_M8.dropna()
M8.shape

(34, 21)

In [453]:
nortel_M9 = nortel[nortel.Reg_date.dt.month.isin([9])]
nortel_M9.shape

(333, 21)

In [454]:
M9 = nortel_M9.dropna()

In [455]:
M9.shape

(40, 21)

In [456]:
nortel_M10 = nortel[nortel.Reg_date.dt.month.isin([10])]
nortel_M10.shape

(297, 21)

In [457]:
M10 = nortel_M10.dropna()
M10.shape

(33, 21)

In [458]:
nortel_M11 = nortel[nortel.Reg_date.dt.month.isin([11])]
nortel_M11.shape

(293, 21)

In [459]:
M11 = nortel_M11.dropna()
M11.shape

(21, 21)

In [460]:
nortel_M12 = nortel[nortel.Reg_date.dt.month.isin([12])]
nortel_M12.shape

(292, 21)

In [461]:
M12 = nortel_M12.dropna()
M12.shape

(25, 21)

In [462]:
nortel.head()

,Unnamed: 0,Acc_no,REG_No,Reg_date,Comp_date,Month_year,RP,RS,Unit,IR,...,OverallPer,t_respond,Understand,t_resolve,s_Del,speak,adv_status,overallper_sat,t_respond_sat,understand_sat
0,0,CST-H514-H3H,NaN,2004-05-14,2005-05-25,2005-05,4 - L,4-C_problem,GPK,Solved,...,60,60,60,60,NaN,60.0,60.0,NaN,NaN,NaN
1,1,CST-H7H6-HH28,CZK3B39B,2004-06-07,2005-08-06,2005-06,3 - M,3-Minor,GPK,Solved,...,80,90,90,90,80.0,90.0,90.0,1.0,1.0,1.0
2,2,CST-H9H1-HH86,NaN,2004-01-09,2005-03-05,2005-05,3 - M,4-C_problem,RPLCDS,Solved,...,40,100,100,50,NaN,90.0,100.0,0.0,1.0,1.0
3,3,CST-1H29-H233,NaN,2004-10-29,2005-05-27,2005-05,2 - H,2-Major,RPLCDS,Solved,...,60,90,90,80,NaN,80.0,80.0,NaN,1.0,1.0
4,4,CST-11H2-H312,CZK26998,2004-02-11,2005-09-05,2005-05,3 - M,3-Minor,GPK,Solved,...,40,80,80,10,100.0,90.0,90.0,0.0,1.0,1.0

In [463]:
#Q2 drop the missing values in each of the above 12 datasets just based on Reg_date variable

In [464]:
nortel.drop(['Reg_date'],axis=1,inplace=True)

In [465]:
#Q3 Append all the above datasets using pd.concat
All_data = pd.concat([M1,M2,M3,M4,M5,M6,M7,M8,M9,M10,M11,M12])

In [466]:
All_data.shape

(311, 21)

In [467]:
#Q4- import payroll dataset  and split the data to create two dataframe for each male and female employes

In [468]:
payroll_male = payroll[payroll["Employee_Gender"]=='M']

In [469]:
payroll_male.shape

(233, 9)

In [470]:
payroll_female = payroll[payroll["Employee_Gender"]=='F']

In [471]:
payroll_female.shape

(191, 9)

In [472]:
payroll.head()

,Unnamed: 0,Employee_ID,Employee_Gender,Salary,Birth_Date,Employee_Hire_Date,Dependents,avg_sal_per_head,test
0,0,120101,M,163040,8/18/1978,7/1/2005,0,inf,inf
1,1,120102,M,108255,8/11/1971,6/1/1991,2,54128.0,54128.0
2,2,120103,M,87975,1/22/1951,1/1/1976,1,87975.0,87975.0
3,3,120104,F,46230,5/11/1956,1/1/1983,1,46230.0,46230.0
4,4,120105,F,27110,12/21/1976,5/1/2001,0,inf,inf

In [473]:
#Q5 - format the Employee_hire_date to the look like YYYY:MM and calcuate sum of salary paid for each of the date

In [474]:
payroll["Employee_Hire_Date"] = pd.to_datetime(payroll["Employee_Hire_Date"])

In [475]:
payroll.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 424 entries, 0 to 423
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Unnamed: 0          424 non-null    int64
 1   Employee_ID         424 non-null    int64
 2   Employee_Gender     424 non-null    object
 3   Salary              424 non-null    int64
 4   Birth_Date          424 non-null    object
 5   Employee_Hire_Date  424 non-null    datetime64[ns]
 6   Dependents          424 non-null    int64
 7   avg_sal_per_head    424 non-null    float64
 8   test                424 non-null    float64
dtypes: datetime64[ns](1), float64(2), int64(4), object(2)
memory usage: 29.9+ KB

In [476]:
payroll['Employee_Date'] = payroll['Employee_Hire_Date'].apply(lambda x: x.strftime('%Y-%m'))

In [477]:
payroll.head()

,Unnamed: 0,Employee_ID,Employee_Gender,Salary,Birth_Date,Employee_Hire_Date,Dependents,avg_sal_per_head,test,Employee_Date
0,0,120101,M,163040,8/18/1978,2005-07-01,0,inf,inf,2005-07
1,1,120102,M,108255,8/11/1971,1991-06-01,2,54128.0,54128.0,1991-06
2,2,120103,M,87975,1/22/1951,1976-01-01,1,87975.0,87975.0,1976-01
3,3,120104,F,46230,5/11/1956,1983-01-01,1,46230.0,46230.0,1983-01
4,4,120105,F,27110,12/21/1976,2001-05-01,0,inf,inf,2001-05

In [478]:
payroll.groupby(['Employee_Date'])["Salary"].sum().reset_index()

    Employee_Date   Salary
0         1976-01  2146350
1         1976-02    85615
2         1976-03    26615
3         1976-04    26165
4         1976-07    28095
..            ...      ...
195       2008-09   160035
196       2008-10   222865
197       2008-11   266200
198       2008-12   776785
199       2009-01    86585

[200 rows x 2 columns]

In [479]:
#Q6 - create month, day,year,weekday, quarter variables from birthdate

In [480]:
payroll["Birth_Date"] = pd.to_datetime(payroll["Birth_Date"])

In [481]:
payroll['day']=payroll.Birth_Date.dt.day
payroll['month']=payroll.Birth_Date.dt.month
payroll['year'] = payroll.Birth_Date.dt.year
payroll['weekday'] = payroll.Birth_Date.dt.weekday
payroll['quarter']=payroll.Birth_Date.dt.quarter

In [482]:
payroll["new_date"]=pd.to_datetime(payroll[["day","month","year"]])

In [483]:
payroll.head()

,Unnamed: 0,Employee_ID,Employee_Gender,Salary,Birth_Date,Employee_Hire_Date,Dependents,avg_sal_per_head,test,Employee_Date,day,month,year,weekday,quarter,new_date
0,0,120101,M,163040,1978-08-18,2005-07-01,0,inf,inf,2005-07,18,8,1978,4,3,1978-08-18
1,1,120102,M,108255,1971-08-11,1991-06-01,2,54128.0,54128.0,1991-06,11,8,1971,2,3,1971-08-11
2,2,120103,M,87975,1951-01-22,1976-01-01,1,87975.0,87975.0,1976-01,22,1,1951,0,1,1951-01-22
3,3,120104,F,46230,1956-05-11,1983-01-01,1,46230.0,46230.0,1983-01,11,5,1956,4,2,1956-05-11
4,4,120105,F,27110,1976-12-21,2001-05-01,0,inf,inf,2001-05,21,12,1976,1,4,1976-12-21